Revit 2016 API
Frame Members
The Frame type exposes the following members.
Constructors
Name | Description
Frame()
 Default constructor. Uses global origin and standard basis vectors.
Frame(XYZ, XYZ, XYZ, XYZ)
 Constructor that takes the frame's base point and three basis vectors.
Methods
Name | Description
Dispose
Releases all resources used by the Frame
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsOrthogonal
 Determines if this frame's basis vectors are orthogonal.
IsOrthonormal
 Determines if this frame's basis vectors are orthonormal.
IsRightHanded
 Determine if this frame's basis is right-handed.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Transform
 Applies the input transform to this frame.
Properties
Name | Description
BasisX
 The first basis vector of the frame.
BasisY
 The second basis vector of the frame.
BasisZ
 The third basis vector of the frame.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The frame's base point.
See Also
Frame Class
Autodesk.Revit.DB Namespace